<html>
<head>
<title>Fonctionnement de Lab3D - Introduction</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="default.css" type="text/css">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<p class="super_title" align="center">Fonctionnement de Lab3D </p>
<p class="grand_parag" align="center">Introduction </p>
<p class="normal" align="left">Lab3D est un logiciel &eacute;crit avec l'environnement 
  de d&eacute;veloppement <a href="http://www.borland.com">Delphi 4</a>, utilisant 
  le langage de programmation Pascal. D'autre part, une librairie de programmation 
  DirectX (DelphiX) a &eacute;t&eacute; utilis&eacute;e pour acc&eacute;l&eacute;rer 
  l'affichage. Il va de soi que DirectX (dans sa version 6.0 au minimum) doit 
  &ecirc;tre install&eacute; sur l'ordinateur voulant ex&eacute;cuter Lab3D, le 
  logiciel de programmation n'&eacute;tant bien entendu pas n&eacute;cessaire.</p>
<p align="left" class="normal">Lab3D n'utilise cependant que la partie DirectDraw 
  de DirectX pour l'affichage 2D. Aucune fonctionalit&eacute; 3D de la carte graphique 
  n'est donc utilis&eacute;e. L'utilisation de Direct3D aurait eu pour cons&eacute;quence 
  directe une acc&eacute;l&eacute;ration drastique de l'affichage d'objets 3D, 
  mais le but &eacute;tant de s'initier aux formules math&eacute;matiques simulant 
  la perspective ou la rotation, l'utilisation de Direct3D a &eacute;t&eacute; 
  &eacute;cart&eacute;e. Cette librairie fait en effet tout faire &agrave; la 
  carte graphique et notre r&ocirc;le dans la programmation de ce logiciel se 
  srait trop limit&eacute; &agrave; envoyer des commandes du genre &quot;<i>Faire 
  tourner le cube autour de l'axe des abscisses en faisant une rotation d'angle 
  3 PI sur 6</i>&quot;... au lieu de les programmer soi-m&ecirc;me.</p>
<hr>
<p align="left" class="normal"><img src="pics/delphi.png" width="686" height="105"><br>
  On utilise Delphi 4 pour programmer, seul &eacute;tant utilis&eacute; le composant 
  TDXDraw.</p>
<p align="left" class="normal">&nbsp; </p>
</body>
</html>
