<html>
<head>
<title>Avant de Commencer...</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="default.css" type="text/css">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<p align="center" class="super_title">Bienvenue dans l'aide de Lab3D !</p>
<p class="grand_parag">1. A propos<img src="pics/title_bkgr.gif" width="1" height="1"></p>
<p class="normal" align="left">Lab3D est un logiciel de mod&eacute;lisation de 
  ph&eacute;nom&egrave;nes physiques sur ordinateur. Nous l'avons r&eacute;alis&eacute; 
  dans le cadre de travaux personnels encadr&eacute;s (TPE) durant l'ann&eacute;e 
  scolaire 2002-2003 au lyc&eacute;e international de Ferney-Voltaire sur la probl&eacute;matique 
  suivante:</p>
<p align="center"><b><img src="pics/Puce1.gif" width="14" height="14">&quot;Comment 
  expliquer les bases d'une animation virtuelle ?&quot;</b></p>
<p class="normal">Cela a tout naturellement conduit &agrave; expliquer les principes 
  math&eacute;matiques et les ph&eacute;nom&egrave;nes physiques qui y sont associ&eacute;s, 
  dans la mesure o&ugrave; l'animation recherch&eacute;e est fid&egrave;le &agrave; 
  la r&eacute;alit&eacute;. &Eacute;tant donn&eacute; qu'il est impossible pour 
  un &ecirc;tre humain normalement constitu&eacute; de dessiner &agrave; la vitesse 
  de 25 images par seconde et de calculer les coordonn&eacute;es 3D de chaque 
  point de ses objets, cela conduit &agrave; la r&eacute;alisation d'un logiciel 
  permettant de le faire.</p>
<p class="normal">Le but n'est pas cependant de r&eacute;aliser un programme professionnel 
  du genre 3D Studio Max mais plut&ocirc;t de comprendre comment ils fonctionnent 
  &agrave; leur base. Le tout am&egrave;ne bien s&ucirc;r &agrave; &eacute;tudier, 
  entre autres, les aspects math&eacute;matiques de la projection d'un espace 
  tridimensionnel dans un rep&egrave;re 2D, puis de comprendre comment est-ce 
  qu'il est possible de complexifier le sujet afin de pouvoir repr&eacute;senter 
  autre chose que des objets simples. C'est dans cette optique-l&agrave; que le 
  plan en quatre parties suivant a &eacute;t&eacute; retenu:</p>
<ol>
  <li class="normal"><b>Les math&eacute;matiques de la 3D.</b> Afin de comprendre 
    quoi que ce soit des rubriques qui suivent, il est essentiel de se familiariser 
    avec un certain nombre de concepts math&eacute;matiques de base tels que les 
    matrices, les vecteurs et les produits vectoriels.</li>
  <li class="normal"><b>Les bases d'un moteur 3D.</b> Que vous vouliez faire afficher 
    un simple cube ou un personnage complexe, les techniques que vous utiliseriez 
    seraient les m&ecirc;mes. Cette rubrique vous fera d&eacute;couvrir comment 
    on peut afficher un objet &agrave; l'&eacute;cran, sans toutefois se pr&eacute;occuper 
    des consid&eacute;rations physiques, l'objet du chapitre suivant.</li>
  <li class="normal"><b>La physique des mouvements</b>. Seront ici &eacute;tudi&eacute;s 
    les deux principaux mouvements, qu'on retrouve partout, &agrave; savoir la 
    translation dans l'espace et la rotation d'un objet. C'est ici que les maths 
    sont les plus compliqu&eacute;es.</li>
  <li class="normal">Enfin, apr&egrave;s que nous auront vu les bases de l'animation, 
    nous nous plongerons dans la partie peut-&ecirc;tre la plus attendue : comment 
    sont con&ccedil;us les personnages de synth&egrave;se ultra-r&eacute;alistes 
    que vous voyez dans tous les films d'animation ou jeux vid&eacute;os. Les 
    trois chapitres pr&eacute;c&eacute;dents vous auront servi pour comprendre 
    comment s'y prennent les sp&eacute;cialistes pour mod&eacute;liser leurs mouvements, 
    extr&ecirc;mement sophistiqu&eacute;s en apparence.</li>
</ol>
<p class="normal"><b><font color="#FF0000">La programmation du logiciel </font><font color="#FF0000"> 
  et la r&eacute;daction de son aide (celle que vous &ecirc;tes en train de lire) 
  ont &eacute;t&eacute; <i><u>int&eacute;gralement</u></i> r&eacute;alis&eacute;es 
  par:</font></b></p>
<ul>
  <li><b>CAILLIEZ C&eacute;line</b></li>
  <li><b><a href="mailto:vitaly.chipounov@free.fr">CHIPOUNOV Vitaly</a></b></li>
  <li><b>LEDET Ga&euml;lle</b></li>
</ul>
<p class="normal">sous la direction de M. Robert, professeur de math&eacute;matiques 
  au lyc&eacute;e de Ferney et de Mme Cadas, professeur de physique.</p>
<p class="grand_parag">2. Ce que vous trouverez dans cette aide</p>
<p class="normal">A part l'aide sur l'utilisation proprement dite du logiciel, 
  vous trouverez surtout des informations sur le fonctionnement interne du programme, 
  par exemple comment il arrive &agrave; repr&eacute;senter des objets en 3D. 
  Vous trouverez ainsi des formules de projection remplies de sinus et de cosinus 
  mais aussi des formules qui sont plus orient&eacute;es &quot;physique&quot;, 
  par exemples les formules des lois de la gravitation. Certains principes math&eacute;matiques, 
  qui ne sont pas forc&eacute;ment vus en classe de Terminale S seront &eacute;galement 
  expliqu&eacute;s, par exemple le fonctionnement des matrices. Bien &eacute;videment, 
  le tout suit le plan d&eacute;fini.</p>
<p align="center"><b><font size="4">Bonne d&eacute;couverte !</font></b></p>
</body>
</html>
