<html>
<head>
<title>Introduction</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="default.css" type="text/css">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<p class="super_title" align="center">Introduction</p>
<p class="normal" >&nbsp;</p>
<p class="normal" >Nous connaissons &agrave; pr&eacute;sent quelles sont les lois 
  de la physique qui interviennent et qui sont la cause des mouvements des objets. 
</p>
<p class="normal" >Cependant, nous avons uniquement jusqu'&agrave; pr&eacute;sent 
  pris en consid&eacute;ration des corps simples tels que des sph&egrave;res. 
  Cela est quelque peu r&eacute;ducteur quand on sait que les films d'animations 
  actuels, faisant intervenir des personnages de plus en plus r&eacute;alistes, 
  ne se bornent pas au d&eacute;placement d'un simple ballon de football (c'est 
  le cas &eacute;galement de nombreux jeux).</p>
<p class="normal" >Nous vous proposons donc de d&eacute;couvrir la mani&egrave;re 
  dont les professionnels font pour parvenir &agrave; leurs fins. Ainsi, on &eacute;tudiera 
  toutes les &eacute;tapes qui contribuent &agrave; la naissance d'un personnage 
  virtuel qui provoque notre &eacute;merveillement.</p>
<p class="normal" >Notons l'utilisation quasi syst&eacute;matique dans ce domaine 
  du logiciel 3D Studio Max (parmi d'autres...). Il est d'une utilisation tr&egrave;s 
  complexe n&eacute;cessitant tout aussi bien une haute dose de savoir-faire technique 
  mais &eacute;galement (et peut-&ecirc;tre surtout) un grand talent artistique.</p>
<p class="normal" >Cette introduction &agrave; la mod&eacute;lisation comporte 
  trois parties. Les deux premi&egrave;res expliqueront les deux fa&ccedil;ons 
  de s'y prendre pour mod&eacute;liser un personnage, en utilisant des polygones 
  ou en partant &agrave; partir de courbes. La troisi&egrave;me enfin expliquera 
  comment on cr&eacute;e des animations faisant intervenir des personnages encore 
  plus r&eacute;alistes en utilisant de vrais &ecirc;tres humains comme mod&egrave;les.</p>
<hr>
<p class="normal" ><img src="pics/3dsmax.png" width="765" height="595"></p>
</body>
</html>
