<html>
<head>


<title>LA CREATION DE PERSONNAGES VIRTUELS A PARTIR DE VERITABLES PERSONNES HUMAINES</title>

<link rel="stylesheet" href="default.css" type="text/css">
</head>
<body bgcolor="#FFFFFF" class="normal">
<p class="super_title" align="center">La cr&eacute;ation de personnages &agrave; 
  partir de v&eacute;ritables &ecirc;tres humains</p>
<p>R&eacute;cemment de d&eacute;veloppement de la technologie informatique a permit 
  celui de nouvelles techniques d’imagerie num&eacute;rique. Une nouvelle technique 
  consiste maintenant &agrave; travailler directement sur des personnes r&eacute;elles, 
  ce qui a donc permis la cr&eacute;ation de personnages humains en images de 
  synth&egrave;se ce qui semblait jusque-l&agrave; idyllique.</p>
<p class=MsoBodyText2>Voici comment, dans le film Final Fantasy, 
  les personnages sont devenus tr&egrave;s r&eacute;alistes&nbsp;:</p>
<p> <img width=400 height=100
src="./model_reel.files/image001.gif" v:shapes="_x0000_i1025"> </p>
<p><b class="grand_parag"> 1. La r&eacute;alisation du film</b></p>
<p> <img width=248 height=157
src="./model_reel.files/image003.jpg" v:shapes="_x0000_i1027"> <img width=270 height=172
src="./model_reel.files/image005.jpg" v:shapes="_x0000_i1028"> </p>
<p>  </p>
<p>La cr&eacute;ation du visage d’Aki, l’h&eacute;ro&iuml;ne de l’histoire, a 
  &eacute;t&eacute; r&eacute;alis&eacute;e en plusieurs &eacute;tapes&nbsp;:</p>
<p> <img width=500 height=210
src="./model_reel.files/image007.jpg" v:shapes="_x0000_i1029"> </p>
<ol>
  <li>Un artiste a d'abord sculpt&eacute; le visage d'Aki en trois dimensions. 
  </li>
  <li>Il a ensuite &eacute;t&eacute; rendu en mode &quot;fil de fer&quot;, proc&eacute;d&eacute; 
    dans lequel une structure &agrave; base de traits, sorte de quadrillage en 
    3D, est superpos&eacute;e sur un croquis du personnage. La structure en fil 
    de fer devient le squelette du personnage et permet &agrave; l'animateur de 
    lui faire effectuer des mouvements et de lui donner une forme proche de celle 
    d'un &ecirc;tre vivant. <br>
    Ensuite, on plaque une texture sur ce grillage. </li>
  <li>La troisi&egrave;me phase consiste &agrave; ajouter la lumi&egrave;re, les 
    sous textures - humidit&eacute;, impuret&eacute;s - les ombres et les d&eacute;tails 
    comme les reflets dans les yeux, les taches de rousseur et les pores. Les 
    autres d&eacute;tails ont &eacute;t&eacute; ajout&eacute;s &agrave; la palette 
    graphique. </li>
  <li>Il n'y a eu aucune num&eacute;risation d'une vraie personne, aucun scanning 
    de peau humaine pour recr&eacute;er ces caract&eacute;ristiques : tout a &eacute;t&eacute; 
    enti&egrave;rement r&eacute;alis&eacute; par ordinateur. <br>
    S&eacute;par&eacute;ment les v&ecirc;tements ont &eacute;t&eacute; programm&eacute;s 
    puis appos&eacute;s sur la forme du personnage. Les directeurs techniques 
    ont pass&eacute; des mois &agrave; d&eacute;chirer et &agrave; d&eacute;sassembler 
    des v&ecirc;tements, &agrave; apprendre &agrave; coudre pour rendre fid&egrave;lement 
    les tissus, leurs plis, leur tomb&eacute;e et leurs mouvements. Les calculs 
    de ces diff&eacute;rentes techniques ont n&eacute;cessit&eacute; des solutions 
    particuli&egrave;res et les programmeurs ont mis au point leurs propres logiciels 
    sophistiqu&eacute;s.</li>
</ol>
<p> <img width=248 height=157
src="./model_reel.files/image009.jpg" v:shapes="_x0000_i1030"> <img width=270 height=172
src="./model_reel.files/image011.jpg" v:shapes="_x0000_i1031">  </p>
<p>Mais c’est surtout pour les mouvements 
  d’Aki qu’une personne r&eacute;elle a &eacute;t&eacute; sollicit&eacute;e&nbsp;; 
  les sc&egrave;nes ont &eacute;t&eacute; interpr&eacute;t&eacute;es physiquement 
  au cours d'un proc&eacute;d&eacute; nomm&eacute; &quot;capture de mouvement&quot;. 
  Un acteur ou un cascadeur portant une combinaison &quot;seconde peau&quot;, 
  &eacute;quip&eacute;e de 37 marqueurs r&eacute;fl&eacute;chissants, effectue 
  les mouvements humains des sc&egrave;nes. Seize cam&eacute;ras sp&eacute;ciales 
  suivent et transmettent &agrave; l'ordinateur la trajectoire des diff&eacute;rents 
  points cl&eacute;s anatomiques, ce qui permet d'int&eacute;grer les mouvements 
  dans la trajectoire et le rythme... .</p>
<p class=MsoBodyText3 align=left style='text-align:left'>Voici ce qui a permis 
  une haute d&eacute;finition des personnages, les mouvements apparaissant moins 
  m&eacute;caniques et donc plus naturels. </p>
<p>Mais il y a encore mieux car les chercheurs travaillent &agrave; perfectionner 
  l’animation faciale des personnages. En effet, m&ecirc;me si cette derni&egrave;re 
  technique utilis&eacute;e pour la cr&eacute;ation du film Final Fantasy am&eacute;liore 
  les mouvements du corps, l’animation du visage a &eacute;t&eacute; enti&egrave;rement 
  r&eacute;alis&eacute;e &agrave; l’ordinateur. Cela pose certaines limites au 
  r&eacute;sultat final car l’animateur ne fait que lui donner des mouvements 
  approximatifs de ceux d’un &ecirc;tre vivant. L'animation est alors trop m&eacute;canique.</p>
<p>Les autres techniques existantes pour animer un visage ont elles aussi leurs 
  limites&nbsp;; par exemple des mod&egrave;les qui ont &eacute;t&eacute; captur&eacute;s 
  par des dispositifs d’acquisition 3D sont photo-r&eacute;alistes mais ne sont 
  pas facilement animables&nbsp;; et d’autres mod&egrave;les qui ont &eacute;t&eacute; 
  pens&eacute;s pour l’animation ne s’adaptent pas suffisamment &agrave; un visage 
  et &agrave; une texture donn&eacute;e pour aboutir &agrave; un rendu parfaitement 
  r&eacute;aliste, notamment lorsque l’on veut travailler pr&eacute;cis&eacute;ment 
  sur la parole et sur une articulation fid&egrave;le.</p>
<p>A cause de ces limites, on perd g&eacute;n&eacute;ralement tout le c&ocirc;t&eacute; 
  dynamique et personnel. C’est pour cela que la capture du mouvement a &eacute;t&eacute; 
  adapt&eacute;e au visage, mais d’une autre mani&egrave;re que pr&eacute;c&eacute;demment. 
  C'est ce que nous allons voir.</p>
<p><b class="grand_parag">2. Clonage 3D et animation articulatoire du visage d'une 
  personne r&eacute;elle pour la communication parl&eacute;e audiovisuelle</b></p>
<p> Voici une pr&eacute;sentation simplifi&eacute;e de cette m&eacute;thode.</p>
<p>Elle propose de partir directement de donn&eacute;es r&eacute;elles collect&eacute;es 
  simultan&eacute;ment sur le sujet &agrave; mod&eacute;liser : on part donc d’un 
  mod&egrave;le enti&egrave;rement audiovisuel en situation de parole. Le mod&egrave;le 
  g&eacute;om&eacute;trique 3D textur&eacute; est construit parall&egrave;lement 
  au mod&egrave;le r&eacute;el d’animation.</p>
<p>Le mod&egrave;le d'animation de l’ordinateur sert &agrave; calculer la position 
  des points. Dans un rep&egrave;re de calibrage li&eacute; &agrave; la t&ecirc;te 
  (mobile), on recueille la position 3D de chaque point plac&eacute; sur le visage, 
  comme le montre cette photo.</p>
<p> <img width=209 height=278
src="./model_reel.files/image013.jpg" v:shapes="_x0000_i1032"> <img width=209 height=278
src="./model_reel.files/image015.jpg" v:shapes="_x0000_i1033"> </p>
<p> De ces mesures, l'ordinateur cr&eacute;e un mod&egrave;le articulatoire avec 
  6 param&egrave;tres de commande ayant pour s&eacute;mantique : </p>
<ol>
  <li>- d&eacute;placement haut/bas de la m&acirc;choire </li>
  <li>- &eacute;tirement horizontal/avanc&eacute;e des l&egrave;vres </li>
  <li>- ouverture/fermeture des l&egrave;vres </li>
  <li>- &eacute;l&eacute;vation simultan&eacute;e des l&egrave;vres </li>
  <li>- d&eacute;placement avant/arri&egrave;re de la m&acirc;choire </li>
  <li>- d&eacute;placement de la pomme d'Adam</li>
</ol>
<p>Avec seulement 6 param&egrave;tres, on a donc un mod&egrave;le d'animation 
  simple, pr&eacute;cis et facilement utilisable.</p>
<p> <img width=151 height=151
src="./model_reel.files/image017.jpg" v:shapes="_x0000_i1034"> <img width=150 height=173
src="./model_reel.files/image019.jpg" v:shapes="_x0000_i1035"> <img width=150 height=168
src="./model_reel.files/image021.jpg" v:shapes="_x0000_i1036"> <img width=151 height=196
src="./model_reel.files/image023.jpg" v:shapes="_x0000_i1037"> </p>
<p>Il permet par exemple d'afficher un 
  mod&egrave;le fil-de-fer si l'on d&eacute;finit un maillage passant par ses 
  points comme pour les quatre vues ci-dessus. </p>
<p class=MsoBodyText>En pratique, le rendu des l&egrave;vres utilise un mod&egrave;le 
  param&eacute;trique raffin&eacute; pour l’affichage. Il est bien s&ucirc;r souhaitable, 
  comme sur la partie gauche de la figure 1 et la partie droite de la figure 4, 
  de rajouter des points statiques suppl&eacute;mentaires pour compl&eacute;ter 
  le mod&egrave;le (cr&acirc;ne, oreilles...), par exemple &agrave; partir de 
  donn&eacute;es d'un scanner 3D. </p>
<p>Ces param&egrave;tres permettent de capter gr&acirc;ce &agrave; des informations 
  visuelle&nbsp;- forme de la bouche, la position des dents et de la langue quand 
  ils sont visibles, ou les plis du visage - beaucoup plus d’expressions personnelles 
  et d’affiner l’articulation. Cette technique permet m&ecirc;me de capter des 
  donn&eacute;es d’organes peu ou pas visibles comme la m&acirc;choire, les dents 
  ou la langue. </p>
<p> <img width=248 height=186
src="./model_reel.files/image025.jpg" v:shapes="_x0000_i1038"> <img width=247 height=198
src="./model_reel.files/image027.jpg" v:shapes="_x0000_i1039"> </p>
<p> </p>
<p>L’articulation devient si pr&eacute;cise que les mal entendants peuvent lire 
  sur les l&egrave;vres. Mais ils ne sont pas les seuls &agrave; profiter de ce 
  canal visuel&nbsp;: dans un environnement bruit&eacute; ou, face &agrave; une 
  langue &eacute;trang&egrave;re, les gains en compr&eacute;hension sont importants 
  pour tous les auditeurs. Si certaines postures tr&egrave;s proches, comme le 
  [p] et le [b], ne sont que peu ou pas diff&eacute;renciables visuellement (bouche 
  ferm&eacute;e), d'autres sons au contraire se diff&eacute;rencient bien plus 
  facilement par l'image ([p] et [t] par exemple). Le progr&egrave;s est donc 
  remarquable.</p>
<p> <img width=221 height=236
src="./model_reel.files/image029.jpg" v:shapes="_x0000_i1042"> <img width=227 height=236
src="./model_reel.files/image031.jpg" v:shapes="_x0000_i1040"> <img width=193 height=236
src="./model_reel.files/image033.jpg" v:shapes="_x0000_i1043"> <img width=232 height=236
src="./model_reel.files/image035.jpg" v:shapes="_x0000_i1041"> </p>
<p> Voici le rendu du mod&egrave;le dans diff&eacute;rentes configurations d'articulation 
  et d'orientation , ensuite on peut bien s&ucirc;r lui appliquer quelques petites 
  transformation comme d&eacute;former le visage.</p>
<p> </p>
<p> <img width=544 height=266
src="./model_reel.files/image037.jpg" v:shapes="_x0000_i1044"> </p>
</body>
</html>
