<html>
<head>
<title>Moment angulaire total et inertie</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="default.css" type="text/css">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<p class="super_title" align="center">Moment angulaire total et inertie</p>
<p class="normal" >Avant d’examiner la relation entre les quantit&eacute;s appartenant 
  &agrave; la dynamique et celles appartenant &agrave; la cin&eacute;matique, 
  on a besoin de d&eacute;finir le moment angulaire total, comme on l’a fait pour 
  le moment lin&eacute;aire total.</p>
<p class="normal" >Le moment angulaire total autour d’un point A est d&eacute;fini 
  comme suit&nbsp;:</p>
<p > <span class="normal"><img
src="./Physique.files/image047.gif" v:shapes="_x0000_i1027"> </span></p>
<p class="normal" >Le moment angulaire total est donc la somme du moment angulaire 
  de tous les points que constituent l’objet, le tout autour du point A, qui le 
  plus souvent est son centre de masse.</p>
<p class="normal" >Mais cette formule est inutilisable pour un corps homog&egrave;ne 
  qui n’est pas constitu&eacute; de quelques points seulement. Cette formule peut 
  &ecirc;tre simplifi&eacute;e en introduisant une nouvelle quantit&eacute;, le 
  moment d’inertie, de la m&ecirc;me mani&egrave;re qu’on a introduit le centre 
  de masse pour simplifier les &eacute;quations du mouvement lin&eacute;aire.</p>
<p class="normal" >Partant de l’&eacute;quation pr&eacute;c&eacute;dente, on peut 
  &eacute;crire que&nbsp;:</p>
<p > <span class="normal"><img
src="./Physique.files/image049.gif" align=left hspace=12 v:shapes="_x0000_s1026"> 
  Om&eacute;ga sort de la somme car la vitesse angulaire est constante pour tous 
  les points.</span></p>
<p class="normal" >Le produit vectoriel d’un vecteur par lui m&ecirc;me mais «&nbsp;perpendicularis&eacute;&nbsp;» 
  &eacute;quivaut &agrave; un produit scalaire normal (norme au carr&eacute;).</p>
<p class="normal" >Ainsi on obtient une nouvelle quantit&eacute;, le moment d’inertie 
  autour du point A.</p>
<p class="normal" >Pour comprendre ce qu’est le moment d’inertie, il faut l’imaginer 
  comme la quantit&eacute; d’effort qu’il faut fournir pour tourner un corps autour 
  d’un point A. Plus le moment d’inertie de corps est grand, plus il faut une 
  force importante pour le faire tourner sur lui-m&ecirc;me.</p>
<p class="normal" >Ainsi, on tourne beaucoup plus vite sur soi-m&ecirc;me lorsqu’on 
  a les bras resserr&eacute;s que lorsqu’ils sont &eacute;cart&eacute;s, si on 
  applique la m&ecirc;me force. Cela est logique puisque le moment d’inertie augmente 
  avec le rayon.</p>
<p class="normal" >Vous n’avez qu’&agrave; observer des patineurs pour vous en 
  convaincre.</p>
<p class="normal" >Il ne nous reste maintenant plus qu’&agrave; d&eacute;terminer 
  l’acc&eacute;l&eacute;ration angulaire. On sait que la d&eacute;riv&eacute;e 
  du moment angulaire est le moment de torsion et que la d&eacute;riv&eacute;e 
  de la vitesse angulaire est l’acc&eacute;l&eacute;ration angulaire, d’o&ugrave; 
  la formule suivante&nbsp;:</p>
<p > <span class="normal"><img
src="./Physique.files/image051.gif" v:shapes="_x0000_i1025"> </span></p>
<p class="normal" >Nous avons &agrave; pr&eacute;sent tout ce qu’il faut pour 
  simuler les translations et les rotations des objets en fonction des forces 
  qu’ils subissent.</p>
<p class="normal" >Voici &agrave; titre indicatif le moment d’inertie de quelques 
  objets usuels&nbsp;:</p>
<p > <span class="normal"><img
src="./Physique.files/image052.gif" v:shapes="_x0000_i1026"> </span></p>
</body>
</html>
