<html>
<head>
<title>Physique - introduction</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="default.css" type="text/css">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<p class="super_title" align="center" >Physique - introduction</p>
<p class="normal" >&nbsp;</p>
<p class="normal" >Maintenant que nous savons comment fonctionne &agrave; sa base 
  un moteur 3D, c’est-&agrave;-dire comment il fait pour repr&eacute;senter des 
  objets quelconques &agrave; l’&eacute;cran, nous allons passer dans le vif du 
  sujet&nbsp;: la simulation de ph&eacute;nom&egrave;nes physiques. En clair&nbsp;: 
  comment fonctionne une animation r&eacute;aliste. Vous en avez tous vu dans 
  des jeux un tant soit peu &eacute;volu&eacute;s ou dans des films d’animation&nbsp;: 
  un monstre re&ccedil;oit une balle dans l’&eacute;paule et le choc lui fait 
  perdre l’&eacute;quilibre et sous l’effet de la gravit&eacute; tombe par terre 
  en tournant sur lui-m&ecirc;me.</p>
<p class=MsoPlainText ><span class="normal">Les Math&eacute;matiques ont une part 
  importante dans les bases d'une animation virtuelle mais il est aussi n&eacute;cessaire 
  d'aborder diff&eacute;rents ph&eacute;nom&egrave;nes physiques afin de comprendre 
  la totalit&eacute; de ces animations. C'est pourquoi nous allons reprendre les 
  bases de la physique ( vitesse, acc&eacute;l&eacute;ration, position d'un objet 
  ou bien encore d'un personnage dans l'espace en fonction du temps...) au niveau 
  de la premi&egrave;re, deuxi&egrave;me et troisi&egrave;me dimension.</span></p>
<p style='text-align:justify;' class="normal">On peut rendre le mouvement aussi 
  complexe que l’on souhaite en prenant en compte une infinit&eacute; de param&egrave;tres. 
  Mais en ce qui nous concerne, on n’utilisera qu’un tout petit champ de la physique 
  appel&eacute; «&nbsp;dynamique&nbsp;», et de mani&egrave;re encore plus pr&eacute;cise, 
  la dynamique des corps solides avec la cin&eacute;matique. La cin&eacute;matique 
  est l’&eacute;tude de la position d’un corps dans l’espace en fonction du temps. 
  Elle ne se pr&eacute;occupe pas des causes du mouvement mais seulement du mouvement 
  lui-m&ecirc;me, contrairement &agrave; la dynamique qui, elle, s’occupe de l’&eacute;tude 
  des forces et des masses qui permettent aux quantit&eacute;s «&nbsp;cin&eacute;matiques&nbsp;» 
  d’&eacute;voluer.</p>
<p class="normal" >Quelle distance parcourt une balle de base-ball en 10 secondes 
  si elle a une vitesse de 50 km/h et se d&eacute;place en ligne droite est un 
  probl&egrave;me de cin&eacute;matique. En effet, on ignore tout des forces qui 
  s'appliquent sur elle &agrave; chaque instant. On se contente de d&eacute;crire 
  son mouvement. <br>
  Quelle distance elle parcourt dans le champ gravitationnel terrestre si je la 
  lance est un probl&egrave;me de dynamique - on prend en compte les forces (gravit&eacute;, 
  frottements, etc...).</p>
<hr>
<p align="center" ><img src="pics/tennis.png" width="400" height="276"></p>
<p align="center" >Une sc&egrave;ne paraissant complexe &agrave; mod&eacute;liser: 
  forces, moments de torsion, vitesses lin&eacute;aires et angulaires &agrave; 
  volont&eacute;, d&eacute;rivations &agrave; ne plus en finir... ouf.</p>
</body>
</html>
